# Interpolation

This is a technique where we fill any value if that are missing in its sequence means age column there 20,21,22,_,24,_,26,27

here missing two value so through interpolation we can fill the estimate value on the base of rest data in column
## Note:
    Mostly this method use when we are dealing with time series data like stockmarket , trading, numeric data with trends, we can't apply this method with nominal data or attributes etc

In [8]:
import pandas as pd;

In [11]:
data={
    "name":["shahid","basit","king","kumail","askari","basit","shukoor","kazim","muhammad","sakina","khatija","kubra"],
    "age":[23,24,25,20,None,23,46,78,64,30,26,28],
    "salary":[3873,9472,None,2890,4232,3211,2222,4562,1234,3421,1235,7632],
    "performance Score":[85,23,45,None,14,45,67,78,90,33,66,88],

}
df=pd.DataFrame(data)
df

        name   age  salary  performance Score
0     shahid  23.0  3873.0               85.0
1      basit  24.0  9472.0               23.0
2       king  25.0     NaN               45.0
3     kumail  20.0  2890.0                NaN
4     askari   NaN  4232.0               14.0
5      basit  23.0  3211.0               45.0
6    shukoor  46.0  2222.0               67.0
7      kazim  78.0  4562.0               78.0
8   muhammad  64.0  1234.0               90.0
9     sakina  30.0  3421.0               33.0
10   khatija  26.0  1235.0               66.0
11     kubra  28.0  7632.0               88.0

### Now Interpolation method

In [ ]:
df.interpolate(method="linear",axis=0,inplace=True)
df

# Sorting and Aggregation

### Sorting

In [ ]:
# Sorting data in 1 column trhough sort_values()
df.sort_values(by="age",ascending=False,inplace=True) # ascending=false/true
print("Sorted data by ascending: \n") 
df

In [ ]:
# Sorting data with multiple column

df.sort_values(by=['age','salary'],ascending=[True,False],inplace=True)
print("Sorting data on the base of multiple column:\n")
df

### Aggregation

the following are the aggregation methods like mean(),median(),mode(),sum(),max(), min(),count(),std(),var()

In [12]:
avgSalary=df['salary'].mean()

print("Average Salary:",avgSalary)

# group on the base of single column
groupVise=df.groupby("age")["salary"].sum()
print("Group vise:\n ",groupVise)


 # group on the base of multiple column
multGrp=df.groupby(["age","name"])['salary'].sum()
print("MultGrp:\n",multGrp)

Average Salary: 3998.5454545454545
Group vise:
  age
20.0    2890.0
23.0    7084.0
24.0    9472.0
25.0       0.0
26.0    1235.0
28.0    7632.0
30.0    3421.0
46.0    2222.0
64.0    1234.0
78.0    4562.0
Name: salary, dtype: float64
MultGrp:
 age   name
20.0  kumail      2890.0
23.0  basit       3211.0
      shahid      3873.0
24.0  basit       9472.0
25.0  king           0.0
26.0  khatija     1235.0
28.0  kubra       7632.0
30.0  sakina      3421.0
46.0  shukoor     2222.0
64.0  muhammad    1234.0
78.0  kazim       4562.0
Name: salary, dtype: float64